let BlockList = externaldata (type: string)
["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Domains/Entertainement"]
with (format='csv', ignoreFirstRecord=false); 

DeviceNetworkEvents
| where RemoteUrl in~(BlockList)
|extend VT_domain = iff(isnotempty(RemoteUrl),strcat(@"https://www.virustotal.com/gui/domain/",RemoteUrl),RemoteUrl)
| project Timestamp, DeviceId, DeviceName, RemoteUrl, LocalIP, InitiatingProcessParentFileName, VT_domain
| summarize VisitCount = dcount(RemoteUrl) by DeviceId




let BlockList = externaldata (type: string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Domains/Entertainement"]
with (format='csv', ignoreFirstRecord=false); 

DeviceNetworkEvents
| extend Host = tolower(parse_url(RemoteUrl).Host)
| extend Host = iff(Host startswith "www.", substring(Host, 4), Host)
| extend DomainParts = split(Host, ".")
| extend BaseDomain = strcat(DomainParts[-2], ".", DomainParts[-1])
| where BaseDomain in~(BlockList)
| summarize VisitCount = dcount(RemoteUrl) by DeviceId
