let BlockList = externaldata (type: string)
["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Domains/Entertainement"]
with (format='csv', ignoreFirstRecord=false); 

DeviceNetworkEvents
| where RemoteUrl in~(BlockList)
|extend VT_domain = iff(isnotempty(RemoteUrl),strcat(@"https://www.virustotal.com/gui/domain/",RemoteUrl),RemoteUrl)
| project Timestamp, DeviceId, DeviceName, RemoteUrl, LocalIP, InitiatingProcessParentFileName, VT_domain
| summarize VisitCount = dcount(RemoteUrl) by DeviceId
