let DeviceList = externaldata(Customer: string, Workspace: string, DeviceId:string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Queries/QueryCSVs/SecurityAlertsID.csv"] with (format="csv", ignoreFirstRecord=True);

DeviceInfo
| join kind=inner(DeviceList) on DeviceId
| where OSPlatform !in~ ("Linux", "IOS", "Android")
| where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
| where isnotempty(OSPlatform)
| where DeviceType == "Workstation"
| distinct DeviceId
