let AlertIds = externaldata(Customer: string, Workspace: string, DeviceId:string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Queries/QueryCSVs/AlertsIds.csv"] with (format="csv", ignoreFirstRecord=True);

DeviceInfo
| join kind=inner(AlertIds) on DeviceId
| where OSPlatform !in~ ("IOS", "Android", "Linux", "Windows", "macOS", "Windows8", "Windows7", "WindowsXp", "WindowsVista")
| where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
| where isnotempty(OSPlatform)
| where DeviceType == "Workstation"
| distinct DeviceId
