let AlertIds = externaldata(Customer: string, Workspace: string, DeviceId: string)
["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Queries/QueryCSVs/AlertsIds.csv"]
with (format="csv", ignoreFirstRecord=true);

DeviceTvmSoftwareInventory
| join kind=leftanti (AlertIds) on DeviceId
| join kind=inner (DeviceInfo | where DeviceType == "Workstation") on DeviceId
| where isnotempty(OSPlatform)
| where OSPlatform !in~ ("IOS", "Android", "Linux", "Windows", "macOS")
| where OSPlatform !contains "Server" and OSPlatform !contains "WVD"
| distinct DeviceId
