//select customers based on case characteristics
let AlertIds = externaldata(Customer: string, Workspace: string, DeviceId:string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Queries/QueryCSVs/SecurityAlertsID.csv"] with (format="csv", ignoreFirstRecord=True);

DeviceInfo
| join kind=leftanti (AlertIds) on DeviceId
| where DeviceType == "Workstation"
| where isnotempty(OSPlatform)
| where OSPlatform !contains "Server" and OSPlatform !contains "WVD" and OSPlatform != "macOS" //modify accordingly
| distinct DeviceId
