let BlockList = externaldata (type: string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Domains/Entertainement.txt"]
with (format='csv', ignoreFirstRecord=false); 

DeviceNetworkEvents
| extend Host = tolower(parse_url(RemoteUrl).Host)
| extend Host = iff(Host startswith "www.", substring(Host, 4), Host)
| extend DomainParts = split(Host, ".")
| extend BaseDomain = strcat(DomainParts[-2], ".", DomainParts[-1])
| where BaseDomain in~(BlockList)
| project DeviceId, DeviceName, RemoteUrl, BaseDomain
| summarize UniqueDomains = dcount(BaseDomain) by DeviceId
