let BlockList = externaldata(type: string)[@"https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/Domains/Malicious.txt"] with (format="csv", ignoreFirstRecord=False)
| where type !startswith "#"
| extend RemoteUrl = replace_string(replace_string(type,"0.0.0.0", "")," ","")
| project RemoteUrl;

DeviceNetworkEvents
| where RemoteUrl in~(BlockList);
| project DeviceId, DeviceName, RemoteUrl
| summarize UniqueDomains = dcount(BaseDomain) by Timestamp, DeviceId
