let BlockList = externaldata(Domain: string, Category: string)["https://raw.githubusercontent.com/LimoWagdy/Thesis/refs/heads/main/DomainLists/Malicious.csv"] with (format="csv", ignoreFirstRecord=True)
let DeviceList = dynamic([""]);  // Add DeviceIds here

DeviceNetworkEvents
| where DeviceId in (DeviceList)
| join kind=leftouter (
	BlockList
) on $left.RemoteUrl == $right.Domain
| extend Malicious = iff(isnotempty(Domain) and Category == "Malicious", 1, 0)
| summarize Malicious = max(Malicious) by DeviceId
